{
  "menu" : {
    "main" : "START",
    "about" : "O MNIE",
    "portfolio" : "PORTFOLIO",
    "contact" : "KONTAKT"
  },
  "main" : {
    "mainText" : "<p>Witaj.</p><p>Jestem Web Develeoperem / Front-end Developerem.</p><p>Zajmuję się kodowaniem stron i aplikacji internetowych.</p>"
  },
  "contact" : {
    "description" : "<p>Aktualnie mieszkam w Zielonce blisko Warszawy.</p><p>Jeśli chcesz się ze mną skontaktować użyj proszę przycisków w stopce strony.</p>",
    "name" : "Twoje imię",
    "email" : "Adres Email",
    "subject" : "Temat",
    "defaultSubject" : "Nic specjalnego",    
    "message" : "Wiadomość",
    "submit" : "Wyślij",
    "minimumError" : "Minimum 3 znaki",
    "emailError" : "Zły adres"
  },
  "about" : {
    "introText" : "<p>Chociaż pisanie wielu linii kodu nie stanowi dla mnie problemu to napisanie kilku zdań o sobie to już nie lada wyzwanie:).</p><p>Może zacznę od tego, że stronami internetowymi zajmuję się od czasów szkoły średniej, czyli gdzieś od 1996r. Wtedy właśnie siedziałem po nocach przed ekranem monitora i wpatrywałem się w dziwne i niezrozumiałe (dla wielu) tagi języka HTML. Oczywiście nie muszę wspominać, że przerodziło się to w moją pasję. Dzięki tej pasji później ukończyłem studia informatyczne i do dziś uwielbiam kodować w językach używanych do tworzenia stron internetowych.<p>",
    "headerCoding" : "Koduję wwwy:)",
    "headerFrameworks" : "Znane frameworki i biblioteki",
    "headerTechnologies" : "Używane technologie",
    "headerCMS" : "Znane CMS'y",
    "headerSoftware" : "Używane oprogramowanie",
    "introSiteHeader" : "Stos technologiczny strony",
    "introSiteText" : "<p>Do strworzenia tej strony wykorzystałem technologie, frameworki, skrypty i biblioteki takie jak:</p><ul><li>HTML</li><li>Sass - Na stronie nie został użyty żaden plik graficzny (z wyjątkiem portfolio)</li><li>BEM</li><li>RWD - Mobile First</li><li>JavaScript</li><li>Angular JS</li><li>jQuery</li><li>PHP - tylko do wysyłania formularza kontaktowego bo obecny hosting nie obsługuje node.js:(</li><li>JSON - teksty polsko i angielsko języczne</li><li>textillate.js - efekt tekstu na stronie głównej</li><li>lettering.js - wymagane przez textillate.js</li><li>enter-view.js</li><li>Google Fonts - Jura</li><li>Visual Studio Code</li><li>GIT</li><li>GitHub - repozytorium z moją stroną dostępne tu: <a href='https://github.com/tomekmy'>github.com/tomekmy</a></li><li>Koala - głównie do konwertowania SCSS do CSS</li><li>Chrome Developer Tools</li><li>Windows</li><li>VirtualBox</li><li>Linux - openSUSE i Ubuntu (testowanie)</li></ul>"
  },
  "portfolio" : {
    "header" : "Ostatnie prace",
    "works" : [
      {
        "title" : "TechCalc - Pomocnik Inżyniera",
        "url" : "www.techcalc.pl",
        "description" : "Aplikacja internetowa dla inżynierów, technologów, konstruktorów. Dzięki TechCalc sprawdzisz otwory pod gwinty, tolerancje pasowań otworów i wałków, obliczysz masę materiałów, obliczysz parametry obróbki. Z funkcji trygonometrycznych wyliczysz parametry trójkąta. TechCalc Pomocnik Inżyniera posiada również wiele innych przydatnych funkcji, które warto sprawdzić.",
        "img" : "img/techcalc-portfolio.jpg"
      },
      {
        "title" : "Centrum Technologiczne Warszawa",
        "url" : "www.centrumtechnologiczne.pl",
        "description" : "Centrum Technologicznym jest międzynarodową korporacją z ponad 20-letnim doświadczeniem w projektowaniu i produkcji maszyn i form do przetwórstwa tworzyw sztucznych. Oferują wiele usług z branży obróbkowej, spawania laserowego i projektowania.",
        "img" : "img/centrumtechnologiczne-portfolio.jpg"
      },
      {
        "title" : "BluePhoto | Ireneusz Rek Fotografia",
        "url" : "www.bluephoto.pl",
        "description" : "Ireneusz Rek - reportaż, dokument, fotograficzne spostrzeżenia autora. Portfolio autora, wybór zdjęć z wykonanych prac jak i relacje z podróży, wydarzeń.",
        "img" : "img/bluephoto-portfolio.jpg"
      },
      {
        "title" : "Wojciech Łagocki - Fotografia",
        "url" : "www.lagocki.pl",
        "description" : "Wojciech Łagocki pasja - Fotografia. Ulubione tematy: fotografia ślubna fotografia niemowlaków noworodków fotografia dziecięca fotografia rodzinna portret. Ulubione miejsca: Warszawa Leżajsk Nidzica",
        "img" : "img/wojtek-portfolio.jpg"
      },
      {
        "title" : "KMP Plastics - maszyny i urządzenia peryferyjne dla Przetwórstwa Tworzyw Sztucznych.",
        "url" : "www.kmpplastics.com.pl",
        "description" : "KMP Plastics - oferuje maszyny i urządzenia peryferyjne dla Przetwórstwa Tworzyw Sztucznych.",
        "img" : "img/kmp-portfolio.jpg"
      }
    ]
  }
}